week5/moma-app/app/views/artists/show.html.erb

  <ul>
    <% @artist.works.each do |work| %>
---
SELECT "works".* FROM "works" WHERE "works"."artist_id" = ?  [["artist_id", 18]]