week5/rails-planets/app/controllers/planets_controller.rb

  def create
    Planet.create(
      name: params[:name],
      image: params[:image],
      orbit: params[:orbit],
      diameter: params[:diameter],
      mass: params[:mass],
      moons: params[:moons]
    )
---
INSERT INTO "planets" ("name", "image", "orbit", "diameter", "mass", "moons") VALUES (?, ?, ?, ?, ?, ?)  [["name", "pluto"], ["image", "www.hoodfhw.do"], ["orbit", 9.0], ["diameter", 32.0], ["mass", 1.0e-05], ["moons", 5]]

  def show
    # Because of the '/planets/:id' route,
    # we get access to the ID used in the URL
    # in the params variable; so if the URL
    # was '/planets/25', the variable params[:id]
    # will contain the string '25'
    @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

  def update

    planet = Planet.find params[:id]
    planet.update(
      name: params[:name],
      image: params[:image],
      orbit: params[:orbit],
      diameter: params[:diameter],
      mass: params[:mass],
      moons: params[:moons]
    )
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "planets" SET "name" = ? WHERE "planets"."id" = ?  [["name", "Earth"], ["id", 19]]

  def destroy

    Planet.destroy params[:id]
---
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 23]]