week8/secrets-app/secrets-server/app/controllers/secrets_controller.rb

SELECT "secrets".* FROM "secrets"
---
  def index
    @secrets = Secret.all

INSERT INTO "secrets" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "hi mummy!"], ["created_at", "2020-01-29 01:09:21.938886"], ["updated_at", "2020-01-29 01:09:21.938886"]]
---
  def create
    @secret = Secret.new(secret_params)

    respond_to do |format|
      if @secret.save

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_secret
      @secret = Secret.find(params[:id])