week11/rails-tdd-fruitstore/app/controllers/fruits_controller.rb

  def index
    @fruits = Fruit.all.reverse
---
SELECT "fruits".* FROM "fruits"

  def create

    fruit = Fruit.create fruit_params
---
INSERT INTO "fruits" ("name", "created_at", "updated_at", "shelf_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Strawberry"], ["created_at", "2020-02-17 05:39:36.429831"], ["updated_at", "2020-02-17 05:39:36.429831"], ["shelf_id", 208]]