week10/burning-airlines-rails-vue/ba-rails-backend/app/controllers/flights_controller.rb

  def index
    render json: Flight.all, include: [:airplane, reservations: {include: :user} ]
---
SELECT "flights".* FROM "flights"

  def show
    # render flight by ID, include reservations, include airplane rows & cols
    flight = Flight.find params[:id]

    # sleep 2

    # Create a hash whose keys look like 'row:col' with a value of true for
    # each booked seat
    # reservations = ...
    reservations_lookup = {}
    user_reservations_lookup = {}

    fake_current_user_id = 13  # use current_user in a real system with working auth

    flight.reservations.each do |res|
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."flight_id" = $1  [["flight_id", 11]]

  def search
    results = Flight.where(
      origin: params[:origin],
      destination: params[:destination]
    )
---
SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2  [["origin", "SYD"], ["destination", "SIN"]]