week10/burning-airlines-rails-vue/ba-rails-backend/app/controllers/flights_controller.rb

  def search
    results = Flight.where(
      origin: params[:origin],
      destination: params[:destination]
    )
---
SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2  [["origin", "SYD"], ["destination", "MEL"]]