week10/burning-airlines-rails-vue/ba-rails-backend/app/controllers/reservations_controller.rb

  def create
    res = Reservation.create(
      row: params[:row],
      col: params[:col],
      user_id: params[:user_id],  # DON'T DO THIS! Use current_user
      flight_id: params[:flight_id]
    )
---
INSERT INTO "reservations" ("row", "col", "flight_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["row", 6], ["col", 4], ["flight_id", 10], ["user_id", 13], ["created_at", "2020-02-11 04:25:58.511799"], ["updated_at", "2020-02-11 04:25:58.511799"]]