week7/ajax-on-rails-jq/app/controllers/dashboard_controller.rb

  def dogs_index
    # AJAX version ONLY
    headers['Access-Control-Allow-Origin'] = '*'
    render json: Dog.all
---
SELECT "dogs".* FROM "dogs"