week5/badger-vision/app/controllers/pets_controller.rb

  def show
    @pet = Pet.find params[:id]
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    pet = Pet.new pet_params
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      pet.image = req["public_id"]
    end
    pet.save
---
INSERT INTO "pets" ("name", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rocky"], ["image", "xftlhyfgg31rne5m1esy"], ["created_at", "2020-01-14 04:57:26.485219"], ["updated_at", "2020-01-14 04:57:26.485219"]]