week5/tunr-db/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def fetch_user
    # Check if the session[:user_id] is set, and also make sure it
    # contains a valid (current) user ID - if so, we will set
    # an instance variable containing the user object.
    # By setting the variable here in the controller superclass,
    # it will be available to any action of any controller,
    # making it easy to check the login status of a user anywhere.

    if session[:user_id].present?
      @current_user = User.find_by id: session[:user_id]