week5/tunr-db/app/controllers/mixtapes_controller.rb

  def create

    # just as example.. normally use strong params!

    # 1.
    # Mixtape.create name: params[:mixtape][:name], user: @current_user

    # 2.
    # mixtape = Mixtape.create name: params[:mixtape][:name]
    # @current_user.mixtapes << mixtape

    # 3.
    @current_user.mixtapes.create name: params[:mixtape][:name]
---
INSERT INTO "mixtapes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Weekend Tunez"], ["created_at", "2020-01-10 03:58:28.048472"], ["updated_at", "2020-01-10 03:58:28.048472"]]

  def index
    # Get ONLY the mixtapes which belong to the logged-in user
    # @mixtapes = Mixtape.where user: @current_user

    @mixtapes = Mixtape.all
---
SELECT "mixtapes".* FROM "mixtapes"

  def edit
    @mixtape = Mixtape.find params[:id]
---
SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

  def update
    @mixtape = Mixtape.find params[:id]
---
SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]