week5/tunr-db/app/controllers/session_controller.rb

  def create

    # See if the email address entered actually exists in the 'users' table
    user = User.find_by email: params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "john@conn.rr"], ["LIMIT", 1]]