week5/blog/app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    # create is used for associations: creates and saves the comment
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Me"], ["body", "greate article!"], ["article_id", 1], ["created_at", "2020-03-19 00:30:32.285703"], ["updated_at", "2020-03-19 00:30:32.285703"]]