week5/moma-app/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "nationality", "period", "image", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "df"], ["nationality", ""], ["period", ""], ["image", ""], ["bio", "df"], ["created_at", "2020-01-08 04:17:11.488750"], ["updated_at", "2020-01-08 04:17:11.488750"]]
---
  def create
    # raise 'hell'  # raise Error

    Artist.create artist_params  # use the filtered version of the form params

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "artists" SET "image" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["image", "http://www.fillmurray.com/300/400"], ["updated_at", "2020-01-08 04:45:48.270552"], ["id", 8]]
---
  def update
    artist = Artist.find params[:id]
    artist.update artist_params  # also use the strong params for the update

DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 7]]
---
  def destroy
    Artist.destroy params[:id]