week5/moma-app/app/controllers/works_controller.rb

INSERT INTO "works" ("title", "year", "image", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    # raise 'hell'

    Work.create work_params

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "works" SET "year" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["year", "1951-05-10"], ["updated_at", "2020-01-08 12:14:54.546229"], ["id", 17]]
---
  def update
    work = Work.find params[:id]
    work.update work_params

DELETE FROM "works" WHERE "works"."id" = ?  [["id", 32]]
---
  def destroy
    Work.destroy params[:id]