week5/moma-app/app/views/works/_form.html.erb

  <!-- <select name="work[artist_id]">
    <%= Artist.all.each do |artist| %>
---
SELECT "artists".* FROM "artists"


  <%= select "work", "artist_id", Artist.all.collect { |artist| [artist.name, artist.id] } %>
---
SELECT "artists".* FROM "artists"